integrations/historical_orders_returns/tests/unit/data/input/order_queue_entry_gc_payment.json

{
  "external_id": "1101284398",
  "shop": "storefront-catalog-en",
  "store_id": "METST",
  "channel_type": "store",
  "channel_name": "magento",
  "placed_at": "2019-09-28T22:15:20+00:00",
  "currency": "CAD",
  "customer_name": "Customer In-Store",
  "customer_email": "test@hotmail.com",
  "shop_locale": "en-US",
  "customer_language": "en",
  "external_customer_id": "5200729",
  "is_fulfilled": true,
  "is_historical": true,
  "notification_blacklist": ["invoice_created", "refund_note_created", "order_pending", "shipment_cancelled", "shipment_dispatched", "shipment_delayed", "order_cancelled", "in_store.ready_for_pick_up"],
  "price_method": "tax_excluded",
  "shipping_address": {
    "first_name": "Customer",
    "last_name": "In-Store",
    "address_line_1": "4700 Kingsway Suite 1205",
    "city": "Burnaby",
    "state": "BC",
    "zip_code": "V5H 4N2",
    "country": "CA"
  },
  "billing_address": {
    "first_name": "Customer",
    "last_name": "In-Store",
    "address_line_1": "4700 Kingsway Suite 1205",
    "city": "Burnaby",
    "state": "BC",
    "zip_code": "V5H 4N2",
    "country": "CA"
  },
  "payments": [{
    "processor": "payment_historical",
    "correlation_ref": "1101284398",
    "type": "captured",
    "amount": 122.08,
    "method": "historical_payment",
    "processed_at": "2019-10-29T19:51:25+00:00"
  }],
  "shipments": [{
    "items": [{
      "external_item_id": "2120168-002-XS",
      "product_id": "2120168-002-XS",
      "price": {
        "item_price": 29.5,
        "item_list_price": 29.5,
        "item_tax_lines": [{
          "amount": 1.48,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 2.06,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "Calculation Adjustment",
          "description": "Calculation Adjustment",
          "coupon_code": "Calculation Adjustment",
          "type": "fixed",
          "original_value": 0.01,
          "price_adjustment": 0.01
        }]
      }
    }, {
      "external_item_id": "2210156-00A-27",
      "product_id": "2210156-00A-27",
      "price": {
        "item_price": 79.5,
        "item_list_price": 79.5,
        "item_tax_lines": [{
          "amount": 3.98,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 5.57,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }]
      }
    }],
    "historical_shipping_option": {
      "price": 0.0,
      "tax": 0.0,
      "service_level_identifier": "IN_STORE_HANDOVER",
      "shipping_type": "in_store_handover",
      "display_name": "In Store",
      "fulfillment_node_id": "METST",
      "shipping_carrier": "historical_carrier",
      "zip_code": "V5H 4N2",
      "country_code": "CA",
      "store_id": "METST"
    }
  }]
}
