integrations/historical_orders_returns/tests/unit/data/input/order_queue_entry_single_discount.json

{
  "external_id": "401147065",
  "shop": "storefront-catalog-en",
  "store_id": "",
  "channel_type": "web",
  "channel_name": "magento",
  "placed_at": "2019-09-05T18:29:09+00:00",
  "currency": "USD",
  "customer_name": "Thomas Test",
  "customer_email": "thomas.foerster@positiveminds.io",
  "shop_locale": "en-US",
  "customer_language": "en",
  "external_customer_id": "5037716",
  "is_fulfilled": true,
  "is_historical": true,
  "notification_blacklist": [
      "invoice_created",
      "refund_note_created",
      "order_pending",
      "shipment_cancelled",
      "shipment_dispatched",
      "shipment_delayed",
      "order_cancelled",
      "in_store.ready_for_pick_up"
  ],
  "price_method": "tax_excluded",
  "shipping_address": {
      "first_name": "Thomas",
      "last_name": "Test",
      "address_line_1": "10 Derrico Ave",
      "city": "Billerica",
      "state": "MA",
      "zip_code": "01821",
      "country": "US"
  },
  "billing_address": {
      "first_name": "Thomas",
      "last_name": "Test",
      "address_line_1": "10 Derrico Ave",
      "city": "Billerica",
      "state": "MA",
      "zip_code": "01821",
      "country": "US"
  },
  "payments": [
      {
          "processor": "payment_historical",
          "correlation_ref": "correlation_ref",
          "type": "captured",
          "amount": 4.99,
          "method": "historical_payment",
          "processed_at": "2019-09-30T20:51:37+00:00"
      }
  ],
  "shipments": [
      {
          "items": [
              {
                  "external_item_id": "2120181-409-XS",
                  "product_id": "2120181-409-XS",
                  "price": {
                      "item_price": 44.5,
                      "item_list_price": 44.5,
                      "item_tax_lines": [],
                      "item_discount_info": [
                          {
                              "discount_ref": "DISCOUNT",
                              "description": "DISCOUNT",
                              "coupon_code": "DISCOUNT",
                              "type": "fixed",
                              "original_value": 9.51,
                              "price_adjustment": 9.51
                          }
                      ],
                      "item_order_discount_info": [
                          {
                              "discount_ref": "SPOFFER30",
                              "description": "SPOFFER30",
                              "coupon_code": "SPOFFER30",
                              "type": "fixed",
                              "original_value": 30,
                              "price_adjustment": 30
                          }
                      ]
                  }
              }
          ],
          "historical_shipping_option": {
              "price": 0,
              "tax": 0,
              "service_level_identifier": "traditional_carrier",
              "shipping_type": "traditional_carrier",
              "display_name": "Standard delivery",
              "fulfillment_node_id": "MTLDC1",
              "shipping_carrier": "traditional_carrier",
              "zip_code": "01821",
              "country_code": "US",
              "routing_strategy": {
                  "strategy": "default"
              }
          }
      }
  ]
}
