integrations/historical_orders_returns/tests/unit/data/input/order_queue_entry_tax_issue-2.json

{
  "external_id": "1101284398",
  "shop": "storefront-catalog-en",
  "store_id": "",
  "channel_type": "web",
  "channel_name": "magento",
  "placed_at": "2019-09-28T16:48:15+00:00",
  "currency": "CAD",
  "customer_name": "Test Tester",
  "customer_email": "test1@gmail.com",
  "shop_locale": "en-US",
  "customer_language": "en",
  "external_customer_id": "262518",
  "is_fulfilled": true,
  "is_historical": true,
  "notification_blacklist": ["invoice_created", "refund_note_created", "order_pending", "shipment_cancelled", "shipment_dispatched", "shipment_delayed", "order_cancelled", "in_store.ready_for_pick_up"],
  "price_method": "tax_excluded",
  "shipping_address": {
    "first_name": "Test",
    "last_name": "Tester",
    "address_line_1": "4453 Main St",
    "city": "Vancouver",
    "state": "BC",
    "zip_code": "V5V0A2",
    "country": "CA"
  },
  "billing_address": {
    "first_name": "Testi",
    "last_name": "Test",
    "address_line_1": "1930 Powell St",
    "city": "Vancouver",
    "state": "BC",
    "zip_code": "V5L 1J3",
    "country": "CA"
  },
  "payments": [{
    "processor": "payment_historical",
    "correlation_ref": "1101284398",
    "type": "captured",
    "amount": 91.86,
    "method": "historical_payment",
    "processed_at": "2019-10-05T01:12:46+00:00"
  }],
  "shipments": [{
    "items": [{
      "external_item_id": "2930005-003-M",
      "product_id": "2930005-003-M",
      "price": {
        "item_price": 49.5,
        "item_list_price": 49.5,
        "item_tax_lines": [{
          "amount": 2.24,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 3.12,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "DISCOUNT",
          "description": "DISCOUNT",
          "coupon_code": "DISCOUNT",
          "type": "fixed",
          "original_value": 5.0,
          "price_adjustment": 5.0
        }]
      }
    }, {
      "external_item_id": "2120138-003-M",
      "product_id": "2120138-003-M",
      "price": {
        "item_price": 44.5,
        "item_list_price": 44.5,
        "item_tax_lines": [{
          "amount": 1.88,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 2.62,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "DISCOUNT",
          "description": "DISCOUNT",
          "coupon_code": "DISCOUNT",
          "type": "fixed",
          "original_value": 7.0,
          "price_adjustment": 7.0
        }]
      }
    }],
    "historical_shipping_option": {
      "price": 0.0,
      "tax": 0.0,
      "service_level_identifier": "traditional_carrier",
      "shipping_type": "traditional_carrier",
      "display_name": "Standard delivery",
      "fulfillment_node_id": "MTLDC1",
      "shipping_carrier": "traditional_carrier",
      "zip_code": "V5V0A2",
      "country_code": "CA",
      "routing_strategy": {
        "strategy": "default"
      }
    }
  }]
}
