integrations/historical_orders_returns/tests/unit/data/input/order_queue_entry_tax_issue-3.json

{
  "external_id": "1101284714",
  "shop": "storefront-catalog-en",
  "store_id": "VANST",
  "channel_type": "store",
  "channel_name": "magento",
  "placed_at": "2019-09-28T18:44:52+00:00",
  "currency": "CAD",
  "customer_name": "Customer In-Store",
  "customer_email": "test@gmail.com",
  "shop_locale": "en-US",
  "customer_language": "en",
  "external_customer_id": "5199727",
  "is_fulfilled": true,
  "is_historical": true,
  "notification_blacklist": [
      "invoice_created",
      "refund_note_created",
      "order_pending",
      "shipment_cancelled",
      "shipment_dispatched",
      "shipment_delayed",
      "order_cancelled",
      "in_store.ready_for_pick_up"
  ],
  "price_method": "tax_excluded",
  "shipping_address": {
      "first_name": "Customer",
      "last_name": "In-Store",
      "address_line_1": "23-550 Browning Pl",
      "city": "North Vancouver",
      "state": "BC",
      "zip_code": "V7H3A9",
      "country": "CA"
  },
  "billing_address": {
      "first_name": "Customer",
      "last_name": "In-Store",
      "address_line_1": "316 W Cordova St",
      "city": "Vancouver",
      "state": "BC",
      "zip_code": "V6B 1E8",
      "country": "CA"
  },
  "payments": [
      {
          "processor": "payment_historical",
          "correlation_ref": "1101284714",
          "type": "captured",
          "amount": 267.12,
          "method": "historical_payment",
          "processed_at": "2019-10-01T21:09:27+00:00"
      }
  ],
  "shipments": [
      {
          "items": [
              {
                  "external_item_id": "1110406-4CC-S",
                  "product_id": "1110406-4CC-S",
                  "price": {
                      "item_price": 79.5,
                      "item_list_price": 79.5,
                      "item_tax_lines": [
                          {
                              "amount": 3.98,
                              "rate": 0.05,
                              "name": "CAN - BC (GST)",
                              "country_code": "CA"
                          },
                          {
                              "amount": 5.57,
                              "rate": 0.07,
                              "name": "CAN - BC (PST)",
                              "country_code": "CA"
                          }
                      ],
                      "item_discount_info": [{
                        "discount_ref": "Calculation Adjustment",
                        "description": "Calculation Adjustment",
                        "coupon_code": "Calculation Adjustment",
                        "type": "fixed",
                        "original_value": 0.03,
                        "price_adjustment": 0.03
                      }]
                  }
              },
              {
                  "external_item_id": "1130151-556-S",
                  "product_id": "1130151-556-S",
                  "price": {
                      "item_price": 79.5,
                      "item_list_price": 79.5,
                      "item_tax_lines": [
                          {
                              "amount": 3.98,
                              "rate": 0.05,
                              "name": "CAN - BC (GST)",
                              "country_code": "CA"
                          },
                          {
                              "amount": 5.57,
                              "rate": 0.07,
                              "name": "CAN - BC (PST)",
                              "country_code": "CA"
                          }
                      ]
                  }
              },
              {
                  "external_item_id": "1210268-4BW-30X32",
                  "product_id": "1210268-4BW-30X32",
                  "price": {
                      "item_price": 79.5,
                      "item_list_price": 79.5,
                      "item_tax_lines": [
                          {
                              "amount": 3.98,
                              "rate": 0.05,
                              "name": "CAN - BC (GST)",
                              "country_code": "CA"
                          },
                          {
                              "amount": 5.57,
                              "rate": 0.07,
                              "name": "CAN - BC (PST)",
                              "country_code": "CA"
                          }
                      ]
                  }
              }
          ],
          "historical_shipping_option": {
              "price": 0,
              "tax": 0,
              "service_level_identifier": "IN_STORE_HANDOVER",
              "shipping_type": "in_store_handover",
              "display_name": "In Store",
              "fulfillment_node_id": "VANST",
              "shipping_carrier": "historical_carrier",
              "zip_code": "V7H3A9",
              "country_code": "CA",
              "store_id": "VANST"
          }
      }
  ]
}
