integrations/historical_orders_returns/tests/unit/data/input/order_queue_entry_tax_issue-4.json

{
  "external_id": "1101284427",
  "shop": "storefront-catalog-en",
  "store_id": "",
  "channel_type": "web",
  "channel_name": "magento",
  "placed_at": "2019-09-28T17:04:51+00:00",
  "currency": "CAD",
  "customer_name": "Aaron Finke",
  "customer_email": "test@gmail.com",
  "shop_locale": "en-US",
  "customer_language": "en",
  "external_customer_id": "4093781",
  "is_fulfilled": true,
  "is_historical": true,
  "notification_blacklist": ["invoice_created", "refund_note_created", "order_pending", "shipment_cancelled", "shipment_dispatched", "shipment_delayed", "order_cancelled", "in_store.ready_for_pick_up"],
  "price_method": "tax_excluded",
  "shipping_address": {
    "first_name": "Aaron",
    "last_name": "Finke",
    "address_line_1": "1953 E Broadway",
    "city": "Vancouver",
    "state": "BC",
    "zip_code": "V5N 1W4",
    "country": "CA"
  },
  "billing_address": {
    "first_name": "Aaron",
    "last_name": "Finke",
    "address_line_1": "1953 E Broadway",
    "city": "Vancouver",
    "state": "BC",
    "zip_code": "V5N 1W4",
    "country": "CA"
  },
  "payments": [{
    "processor": "payment_historical",
    "correlation_ref": "1101284427",
    "type": "captured",
    "amount": 266.56,
    "method": "historical_payment",
    "processed_at": "2019-11-11T19:36:27+00:00"
  }],
  "shipments": [{
    "items": [{
      "external_item_id": "1120531-4BO-M",
      "product_id": "1120531-4BO-M",
      "price": {
        "item_price": 79.5,
        "item_list_price": 79.5,
        "item_tax_lines": [{
          "amount": 3.73,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 5.21,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "DISCOUNT",
          "description": "DISCOUNT",
          "coupon_code": "DISCOUNT",
          "type": "fixed",
          "original_value": 5.0,
          "price_adjustment": 5.0
        }],
        "item_order_discount_info": [{
          "discount_ref": "Calculation Adjustment",
          "description": "Calculation Adjustment",
          "coupon_code": "Calculation Adjustment",
          "type": "fixed",
          "original_value": 0.03,
          "price_adjustment": 0.03
        }]
      }
    }, {
      "external_item_id": "1120489-584-M",
      "product_id": "1120489-584-M",
      "price": {
        "item_price": 39.5,
        "item_list_price": 39.5,
        "item_tax_lines": [{
          "amount": 1.73,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 2.42,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "DISCOUNT",
          "description": "DISCOUNT",
          "coupon_code": "DISCOUNT",
          "type": "fixed",
          "original_value": 5.0,
          "price_adjustment": 5.0
        }]
      }
    }, {
      "external_item_id": "1110410-5CI-S",
      "product_id": "1110410-5CI-S",
      "price": {
        "item_price": 79.5,
        "item_list_price": 79.5,
        "item_tax_lines": [{
          "amount": 3.48,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 4.87,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "DISCOUNT",
          "description": "DISCOUNT",
          "coupon_code": "DISCOUNT",
          "type": "fixed",
          "original_value": 10.0,
          "price_adjustment": 10.0
        }]
      }
    }, {
      "external_item_id": "1110274-5CI-S",
      "product_id": "1110274-5CI-S",
      "price": {
        "item_price": 69.5,
        "item_list_price": 69.5,
        "item_tax_lines": [{
          "amount": 2.98,
          "rate": 0.05,
          "name": "CAN - BC (GST)",
          "country_code": "CA"
        }, {
          "amount": 4.17,
          "rate": 0.07,
          "name": "CAN - BC (PST)",
          "country_code": "CA"
        }],
        "item_discount_info": [{
          "discount_ref": "DISCOUNT",
          "description": "DISCOUNT",
          "coupon_code": "DISCOUNT",
          "type": "fixed",
          "original_value": 10.0,
          "price_adjustment": 10.0
        }]
      }
    }],
    "historical_shipping_option": {
      "price": 0.0,
      "tax": 0.0,
      "service_level_identifier": "traditional_carrier",
      "shipping_type": "traditional_carrier",
      "display_name": "Standard delivery",
      "fulfillment_node_id": "MTLDC1",
      "shipping_carrier": "traditional_carrier",
      "zip_code": "V5N 1W4",
      "country_code": "CA",
      "routing_strategy": {
        "strategy": "default"
      }
    }
  }]
}
