integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_discount_no_amount.json

{
  "order_id": "1101284390",
  "payload": "{\"details\": {\"Name\": \"1101284390\", \"Email\": \"test@gmail.com\", \"Financial Status\": \"paid\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"CAD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-10-03T00:33:58+00:00\", \"Tags\": \"group:Frank  Oak - Members, Final Sale, isStaffOrder, isAutoship, isEditorBox, isStylePlan\", \"Processed At\": \"2019-09-28T16:43:52+00:00\", \"Source name\": \"magento\", \"Total weight\": \"2.0000\", \"Total Tax\": \"29.6100\", \"Shipping Name\": \"Test Test\", \"Shipping First Name\": \"Test\", \"Shipping Last Name\": \"Test\", \"Shipping Address1\": \"1238 Dundas St E\", \"Shipping City\": \"Toronto\", \"Shipping Province\": \"Ontario\", \"Shipping Province Code\": \"ON\", \"Shipping Zip\": \"M4M 0C6\", \"Shipping Country\": \"Canada\", \"Shipping Country Code\": \"CA\", \"Billing Name\": \"Test Test\", \"Billing First Name\": \"Test\", \"Billing Last Name\": \"Test\", \"Billing Address1\": \"1238 Dundas St E\", \"Billing City\": \"Toronto\", \"Billing Province\": \"Ontario\", \"Billing Province Code\": \"ON\", \"Billing Zip\": \"M4M 0C6\", \"Billing Country\": \"Canada\", \"Billing Country Code\": \"CA\", \"Taxes Included\": \"FALSE\", \"Discount Code\": \"SEPTEMBER15\", \"Discount Type\": \"amount\", \"Mage Customer Id\": \"1118911\"}, \"items\": [{\"Name\": \"1101284390\", \"Lineitem name\": \"Twisted Yarn Crewneck in Leather Brown\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"89.5000\", \"Lineitem variant title\": \"1130157-2EK-M\", \"Lineitem compare at price\": \"89.5000\", \"Lineitem sku\": \"1130157-2EK-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - ON (HST)\", \"Tax 1 Price\": \"9.89\", \"Tax 1 Rate\": \"0.13\"}, {\"Name\": \"1101284390\", \"Lineitem name\": \"Good Cotton Fleece Crewneck in Vintage Grey\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"69.5000\", \"Lineitem variant title\": \"1120435-138-M\", \"Lineitem compare at price\": \"69.5000\", \"Lineitem sku\": \"1120435-138-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - ON (HST)\", \"Tax 1 Price\": \"7.68\", \"Tax 1 Rate\": \"0.13\"}, {\"Name\": \"1101284390\", \"Lineitem name\": \"Cotton-Recycled Poly Crewneck in Washed Black\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"69.5000\", \"Lineitem variant title\": \"1120521-009-M\", \"Lineitem compare at price\": \"69.5000\", \"Lineitem sku\": \"1120521-009-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - ON (HST)\", \"Tax 1 Price\": \"7.68\", \"Tax 1 Rate\": \"0.13\"}, {\"Name\": \"1101284390\", \"Lineitem name\": \"Classic Leather Belt in Tan\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"39.5000\", \"Lineitem variant title\": \"1930011-218-32\", \"Lineitem compare at price\": \"39.5000\", \"Lineitem sku\": \"1930011-218-32\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - ON (HST)\", \"Tax 1 Price\": \"4.36\", \"Tax 1 Rate\": \"0.13\"}], \"shipping\": {\"Name\": \"1101284390\", \"Shipping Line Code\": \"DOM.EP\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Standard Shipping\", \"Shipping Line Carrier Identifier\": \"canadapost\", \"Shipping Tax 1 Title\": \"shipping_tax\", \"Shipping Tax 1 Rate\": \"0.13\", \"Shipping Tax 1 Price\": \"0.0000\"}, \"payment\": {\"Name\": \"1101284390\", \"Transaction Amount\": \"257.4100\", \"Transaction Kind\": \"capture\", \"Transaction Status\": \"success\", \"Transaction Processed At\": \"2019-10-03T00:33:58+00:00\", \"Transaction Gateway\": \"paysafe\", \"Transaction Source Name\": \"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/77.0.3865.90 Safari/537.36\"}}",
  "status": "new"
}
