integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_gc_payment.json

{
  "order_id": "1101284398",
  "payload": "{\"details\": {\"Name\": \"1101284398\", \"Email\": \"test@hotmail.com\", \"Financial Status\": \"paid\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"CAD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-09-28T22:15:20+00:00\", \"Tags\": \"group:Frank  Oak - Members, Final Sale, isStaffOrder, isAutoship, isEditorBox, isStylePlan\", \"Processed At\": \"2019-09-28T22:15:20+00:00\", \"Source name\": \"magento\", \"Total weight\": \"0.7000\", \"Total Tax\": \"13.0800\", \"Shipping Company\": \"METST\", \"Shipping Name\": \"Customer In-Store\", \"Shipping First Name\": \"Customer\", \"Shipping Last Name\": \"In-Store\", \"Shipping Address1\": \"4700 Kingsway Suite 1205\", \"Shipping Address2\": \"Burnaby\", \"Shipping City\": \"Burnaby\", \"Shipping Province\": \"British Columbia\", \"Shipping Province Code\": \"BC\", \"Shipping Zip\": \"V5H 4N2\", \"Shipping Country\": \"Canada\", \"Shipping Country Code\": \"CA\", \"Billing Company\": \"METST\", \"Billing Name\": \"Customer In-Store\", \"Billing First Name\": \"Customer\", \"Billing Last Name\": \"In-Store\", \"Billing Address1\": \"4700 Kingsway Suite 1205\", \"Billing Address2\": \"Burnaby\", \"Billing City\": \"Burnaby\", \"Billing Province\": \"British Columbia\", \"Billing Province Code\": \"BC\", \"Billing Zip\": \"V5H 4N2\", \"Billing Country\": \"Canada\", \"Billing Country Code\": \"CA\", \"Taxes Included\": \"FALSE\", \"Store Code\": \"METST\", \"Mage Customer Id\": \"5200729\"}, \"items\": [{\"Name\": \"1101285272\", \"Lineitem name\": \"The Good Cotton Boy Tee in Black\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"29.5000\", \"Lineitem variant title\": \"2120168-002-XS\", \"Lineitem compare at price\": \"29.5000\", \"Lineitem sku\": \"2120168-002-XS\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"1.475\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"2.065\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101285272\", \"Lineitem name\": \"The Debbie High Waist Skinny Jean in Black\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"79.5000\", \"Lineitem variant title\": \"2210156-00A-27\", \"Lineitem compare at price\": \"79.5000\", \"Lineitem sku\": \"2210156-00A-27\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"3.975\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"5.565\", \"Tax 2 Rate\": \"0.07\"}], \"shipping\": {\"Name\": \"1101285272\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Purchased in store\", \"Shipping Tax 1 Title\": \"shipping_tax\", \"Shipping Tax 1 Rate\": \"0.12\", \"Shipping Tax 1 Price\": \"0.0000\"}, \"payment\": {}, \"giftcard_payment\": {\"Transaction Amount\": 122.0800, \"Transaction Processed At\": \"2019-10-29T19:51:25+00:00\"}}",
  "status": "new"
}
