integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_percentage_discount.json

{
  "order_id": "1101284387",
  "payload": "{\"details\": {\"Name\": \"1101284387\", \"Email\": \"test@yahoo.ca\", \"Financial Status\": \"paid\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"CAD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-10-29T19:51:25+00:00\", \"Tags\": \"Final Sale, isStaffOrder, isAutoship, isEditorBox, isStylePlan\", \"Processed At\": \"2019-09-28T16:41:36+00:00\", \"Source name\": \"magento\", \"Total weight\": \"2.2000\", \"Total Tax\": \"58.1700\", \"Shipping Name\": \"Test\", \"Shipping First Name\": \"Test\", \"Shipping Last Name\": \"Pierrot-Collette\", \"Shipping Address1\": \"5870\", \"Shipping Address2\": \"1re av\", \"Shipping City\": \"Montreal\", \"Shipping Province\": \"Quebec\", \"Shipping Province Code\": \"QC\", \"Shipping Zip\": \"H1Y 3A5\", \"Shipping Country\": \"Canada\", \"Shipping Country Code\": \"CA\", \"Billing Name\": \"Test\", \"Billing First Name\": \"Test\", \"Billing Last Name\": \"Pierrot-Collette\", \"Billing Address1\": \"5870\", \"Billing Address2\": \"1re av\", \"Billing City\": \"Montreal\", \"Billing Province\": \"Quebec\", \"Billing Province Code\": \"QC\", \"Billing Zip\": \"H1Y 3A5\", \"Billing Country\": \"Canada\", \"Billing Country Code\": \"CA\", \"Taxes Included\": \"FALSE\", \"Discount Code\": \"WELCOME777362\", \"Discount Amount\": \"15.0000\", \"Discount Type\": \"percent\", \"Mage Customer Id\": \"5199178\"}, \"items\": [{\"Name\": \"1101284387\", \"Lineitem name\": \"SeaCell\u2122-Cotton Oversized Cropped Sweater in Golden Palm\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"89.5000\", \"Lineitem variant title\": \"2130079-5FH-M\", \"Lineitem compare at price\": \"89.5000\", \"Lineitem sku\": \"2130079-5FH-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - QC (GST)\", \"Tax 1 Price\": \"3.803\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - QC (QST)\", \"Tax 2 Price\": \"7.587\", \"Tax 2 Rate\": \"0.09975\"}, {\"Name\": \"1101284387\", \"Lineitem name\": \"The Debbie Ultra-Stretch Jean in Light Indigo\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"89.5000\", \"Lineitem variant title\": \"2210205-4CV-29\", \"Lineitem compare at price\": \"89.5000\", \"Lineitem sku\": \"2210205-4CV-29\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - QC (GST)\", \"Tax 1 Price\": \"3.803\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - QC (QST)\", \"Tax 2 Price\": \"7.587\", \"Tax 2 Rate\": \"0.09975\"}, {\"Name\": \"1101284387\", \"Lineitem name\": \"The Debbie Ultra-Stretch Jean in Light Indigo\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"89.5000\", \"Lineitem variant title\": \"2210205-4CV-30\", \"Lineitem compare at price\": \"89.5000\", \"Lineitem sku\": \"2210205-4CV-30\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - QC (GST)\", \"Tax 1 Price\": \"3.8063\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - QC (QST)\", \"Tax 2 Price\": \"7.5937\", \"Tax 2 Rate\": \"0.09975\"}, {\"Name\": \"1101284387\", \"Lineitem name\": \"Cotton Long-Sleeved Mockneck in Pine Grove\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"49.5000\", \"Lineitem variant title\": \"2120205-5CL-M\", \"Lineitem compare at price\": \"49.5000\", \"Lineitem sku\": \"2120205-5CL-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - QC (GST)\", \"Tax 1 Price\": \"2.1035\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - QC (QST)\", \"Tax 2 Price\": \"4.1965\", \"Tax 2 Rate\": \"0.09975\"}, {\"Name\": \"1101284387\", \"Lineitem name\": \"Long Sleeved Modal-Blend  Ribbed Tee in Burgundy\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"39.5000\", \"Lineitem variant title\": \"2120138-330-M\", \"Lineitem compare at price\": \"39.5000\", \"Lineitem sku\": \"2120138-330-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - QC (GST)\", \"Tax 1 Price\": \"1.6761\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - QC (QST)\", \"Tax 2 Price\": \"3.3439\", \"Tax 2 Rate\": \"0.09975\"}, {\"Name\": \"1101284387\", \"Lineitem name\": \"Utility Pinafore in Black\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"99.5000\", \"Lineitem variant title\": \"2510251-002-M\", \"Lineitem compare at price\": \"99.5000\", \"Lineitem sku\": \"2510251-002-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - QC (GST)\", \"Tax 1 Price\": \"4.2304\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - QC (QST)\", \"Tax 2 Price\": \"8.4396\", \"Tax 2 Rate\": \"0.09975\"}], \"shipping\": {\"Name\": \"1101284387\", \"Shipping Line Code\": \"DOM.EP\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Standard Shipping\", \"Shipping Line Carrier Identifier\": \"canadapost\", \"Shipping Tax 1 Title\": \"shipping_tax\", \"Shipping Tax 1 Rate\": \"0.14975\", \"Shipping Tax 1 Price\": \"0.0000\"}, \"payment\": {\"Name\": \"1101284387\", \"Transaction Amount\": \"446.6200\", \"Transaction Kind\": \"capture\", \"Transaction Status\": \"success\", \"Transaction Processed At\": \"2019-10-29T19:51:25+00:00\", \"Transaction Gateway\": \"paysafe\", \"Transaction Source Name\": \"Mozilla/5.0 (iPhone; CPU iPhone OS 12_4_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.1.2 Mobile/15E148 Safari/604.1\"}}",
  "status": "new"
}
