integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_single_discount.json

{
  "order_id": "401147065",
  "payload": "{\"details\": {\"Name\": \"401147065\", \"Email\": \"thomas.foerster@positiveminds.io\", \"Financial Status\": \"refunded\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"USD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-09-30T20:51:37+00:00\", \"Tags\": \"group:stylePlan, Final Sale, isStaffOrder, isAutoship, isEditorBox\", \"Processed At\": \"2019-09-05T18:29:09+00:00\", \"Source name\": \"magento\", \"Total weight\": \"0.1500\", \"Total Tax\": \"0.0000\", \"Shipping Name\": \"Thomas Test\", \"Shipping First Name\": \"Thomas\", \"Shipping Last Name\": \"Test\", \"Shipping Address1\": \"10 Derrico Ave\", \"Shipping City\": \"Billerica\", \"Shipping Province\": \"Massachusetts\", \"Shipping Province Code\": \"MA\", \"Shipping Zip\": \"01821\", \"Shipping Country\": \"United States of America\", \"Shipping Country Code\": \"US\", \"Billing Name\": \"Thomas Test\", \"Billing First Name\": \"Thomas\", \"Billing Last Name\": \"Test\", \"Billing Address1\": \"10 Derrico Ave\", \"Billing City\": \"Billerica\", \"Billing Province\": \"Massachusetts\", \"Billing Province Code\": \"MA\", \"Billing Zip\": \"01821\", \"Billing Country\": \"United States of America\", \"Billing Country Code\": \"US\", \"Taxes Included\": \"FALSE\", \"Discount Code\": \"SPOFFER30\", \"Discount Amount\": \"30.0000\", \"Discount Type\": \"amount\", \"Mage Customer Id\": \"5037716\"}, \"items\": [{\"Name\": \"401147065\", \"Lineitem name\": \"Boxy Linen and Tencel\\u00aeLyocell Striped Tee in Baby Blue\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"34.9900\", \"Lineitem variant title\": \"2120181-409-XS\", \"Lineitem compare at price\": \"44.5000\", \"Lineitem sku\": \"2120181-409-XS\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"FALSE\", \"Lineitem fulfillment status\": \"fulfilled\"}], \"shipping\": {\"Name\": \"401147065\", \"Shipping Line Code\": \"65\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Standard Shipping\", \"Shipping Line Carrier Identifier\": \"ups\"}, \"payment\": {\"Name\": \"401147065\", \"Transaction Amount\": \"4.9900\", \"Transaction Kind\": \"refund\", \"Transaction Status\": \"success\", \"Transaction Processed At\": \"2019-09-30T20:51:37+00:00\", \"Transaction Gateway\": \"Legacy Gift Card\", \"Transaction Source Name\": \"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.109 Safari/537.36\"}}",
  "status": "new"
}
