integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_tax_issue-3.json

{
  "order_id": "1101284398",
  "payload": "{\"details\": {\"Name\": \"1101284714\", \"Email\": \"test@gmail.com\", \"Financial Status\": \"paid\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"CAD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-10-01T21:09:27+00:00\", \"Tags\": \"group:Frank  Oak - Members, Final Sale, isStaffOrder, isAutoship, isEditorBox, isStylePlan\", \"Processed At\": \"2019-09-28T18:44:52+00:00\", \"Source name\": \"magento\", \"Total weight\": \"1.2000\", \"Total Tax\": \"28.6200\", \"Shipping Company\": \"VANST\", \"Shipping Name\": \"Customer In-Store\", \"Shipping First Name\": \"Customer\", \"Shipping Last Name\": \"In-Store\", \"Shipping Address1\": \"23-550 Browning Pl\", \"Shipping City\": \"North Vancouver\", \"Shipping Province\": \"British Columbia\", \"Shipping Province Code\": \"BC\", \"Shipping Zip\": \"V7H3A9\", \"Shipping Country\": \"Canada\", \"Shipping Country Code\": \"CA\", \"Billing Company\": \"VANST\", \"Billing Name\": \"Customer In-Store\", \"Billing First Name\": \"Customer\", \"Billing Last Name\": \"In-Store\", \"Billing Address1\": \"316 W Cordova St\", \"Billing Address2\": \"Vancouver\", \"Billing City\": \"Vancouver\", \"Billing Province\": \"British Columbia\", \"Billing Province Code\": \"BC\", \"Billing Zip\": \"V6B 1E8\", \"Billing Country\": \"Canada\", \"Billing Country Code\": \"CA\", \"Taxes Included\": \"FALSE\", \"Store Code\": \"VANST\", \"Mage Customer Id\": \"5199727\"}, \"items\": [{\"Name\": \"1101284714\", \"Lineitem name\": \"Herringbone Plaid Shirt in Dark Blue\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"79.5000\", \"Lineitem variant title\": \"1110406-4CC-S\", \"Lineitem compare at price\": \"79.5000\", \"Lineitem sku\": \"1110406-4CC-S\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"3.975\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"5.565\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101284714\", \"Lineitem name\": \"SeaCell\u2122-Cotton Waffle Crewneck in Rosin\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"79.5000\", \"Lineitem variant title\": \"1130151-556-S\", \"Lineitem compare at price\": \"79.5000\", \"Lineitem sku\": \"1130151-556-S\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"3.975\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"5.565\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101284714\", \"Lineitem name\": \"The Brunswick Slim Chino Pant in Deep Blue\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"79.5000\", \"Lineitem variant title\": \"1210268-4BW-30X32\", \"Lineitem compare at price\": \"79.5000\", \"Lineitem sku\": \"1210268-4BW-30X32\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"3.975\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"5.565\", \"Tax 2 Rate\": \"0.07\"}], \"shipping\": {\"Name\": \"1101284714\", \"Shipping Line Code\": \"11\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Purchased in store\", \"Shipping Line Carrier Identifier\": \"ups\", \"Shipping Tax 1 Title\": \"shipping_tax\", \"Shipping Tax 1 Rate\": \"0.12\", \"Shipping Tax 1 Price\": \"0.0000\"}, \"payment\": {\"Name\": \"1101284714\", \"Transaction Amount\": \"267.1200\", \"Transaction Kind\": \"capture\", \"Transaction Status\": \"success\", \"Transaction Processed At\": \"2019-10-01T21:09:27+00:00\", \"Transaction Gateway\": \"frankoak_cc\", \"Transaction Source Name\": \"retail\"}}",
  "status": "new"
}
