integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_tax_issue-4.json

{
  "order_id": "1101284427",
  "payload": "{\"details\": {\"Name\": \"1101284427\", \"Email\": \"test@gmail.com\", \"Financial Status\": \"paid\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"CAD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-11-11T19:36:27+00:00\", \"Tags\": \"group:stylePlan, Final Sale, isStaffOrder, isEditorBox, isStylePlan\", \"Processed At\": \"2019-09-28T17:04:51+00:00\", \"Source name\": \"magento\", \"Total weight\": \"1.3500\", \"Total Tax\": \"28.5600\", \"Shipping Name\": \"Aaron Finke\", \"Shipping First Name\": \"Aaron\", \"Shipping Last Name\": \"Finke\", \"Shipping Address1\": \"1953 E Broadway\", \"Shipping City\": \"Vancouver\", \"Shipping Province\": \"British Columbia\", \"Shipping Province Code\": \"BC\", \"Shipping Zip\": \"V5N 1W4\", \"Shipping Country\": \"Canada\", \"Shipping Country Code\": \"CA\", \"Billing Name\": \"Aaron Finke\", \"Billing First Name\": \"Aaron\", \"Billing Last Name\": \"Finke\", \"Billing Address1\": \"1953 E Broadway\", \"Billing City\": \"Vancouver\", \"Billing Province\": \"British Columbia\", \"Billing Province Code\": \"BC\", \"Billing Zip\": \"V5N 1W4\", \"Billing Country\": \"Canada\", \"Billing Country Code\": \"CA\", \"Taxes Included\": \"FALSE\", \"Mage Customer Id\": \"4093781\"}, \"items\": [{\"Name\": \"1101284427\", \"Lineitem name\": \"Good Cotton Fleece Hoodie in Navy\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"74.5000\", \"Lineitem variant title\": \"1120531-4BO-M\", \"Lineitem compare at price\": \"79.5000\", \"Lineitem sku\": \"1120531-4BO-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"3.725\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"5.215\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101284427\", \"Lineitem name\": \"Graphic Print Good Cotton Tee in Dark Green\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"34.5000\", \"Lineitem variant title\": \"1120489-584-M\", \"Lineitem compare at price\": \"39.5000\", \"Lineitem sku\": \"1120489-584-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"1.725\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"2.415\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101284427\", \"Lineitem name\": \"Good Cotton Corduroy Shirt in Olive\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"69.5000\", \"Lineitem variant title\": \"1110410-5CI-S\", \"Lineitem compare at price\": \"79.5000\", \"Lineitem sku\": \"1110410-5CI-S\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"3.475\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"4.865\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101284427\", \"Lineitem name\": \"Marled Cotton Shirt in Olive\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"59.5000\", \"Lineitem variant title\": \"1110274-5CI-S\", \"Lineitem compare at price\": \"69.5000\", \"Lineitem sku\": \"1110274-5CI-S\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"2.975\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"4.165\", \"Tax 2 Rate\": \"0.07\"}], \"shipping\": {\"Name\": \"1101284427\", \"Shipping Line Code\": \"DOM.EP\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Standard Shipping\", \"Shipping Line Carrier Identifier\": \"canadapost\", \"Shipping Tax 1 Title\": \"shipping_tax\", \"Shipping Tax 1 Rate\": \"0.12\", \"Shipping Tax 1 Price\": \"0.0000\"}, \"payment\": {\"Name\": \"1101284427\", \"Transaction Amount\": \"266.5600\", \"Transaction Kind\": \"capture\", \"Transaction Status\": \"success\", \"Transaction Processed At\": \"2019-11-11T19:36:27+00:00\", \"Transaction Gateway\": \"paysafe\", \"Transaction Source Name\": \"GuzzleHttp/6.1.1 curl/7.35.0 PHP/5.6.31-1~ubuntu14.04.1+deb.sury.org+1\"}}",
  "status": "new"
}
