integrations/historical_orders_returns/tests/unit/data/input/order_table_entry_tax_issue.json

{
  "order_id": "1101284398",
  "payload": "{\"details\": {\"Name\": \"1101284398\", \"Email\": \"test1@gmail.com\", \"Financial Status\": \"paid\", \"Fulfillment Status\": \"fulfilled\", \"Currency\": \"CAD\", \"Buyer Accepts Marketing\": \"TRUE\", \"Closed At\": \"2019-10-05T01:12:46+00:00\", \"Tags\": \"group:stylePlan, Final Sale, isStaffOrder, isAutoship, isEditorBox\", \"Processed At\": \"2019-09-28T16:48:15+00:00\", \"Source name\": \"magento\", \"Total weight\": \"0.4500\", \"Total Tax\": \"9.8400\", \"Shipping Name\": \"Test Tester\", \"Shipping First Name\": \"Test\", \"Shipping Last Name\": \"Tester\", \"Shipping Address1\": \"4453 Main St\", \"Shipping City\": \"Vancouver\", \"Shipping Province\": \"British Columbia\", \"Shipping Province Code\": \"BC\", \"Shipping Zip\": \"V5V0A2\", \"Shipping Country\": \"Canada\", \"Shipping Country Code\": \"CA\", \"Billing Name\": \"Testi Test\", \"Billing First Name\": \"Testi\", \"Billing Last Name\": \"Test\", \"Billing Address1\": \"1930 Powell St\", \"Billing City\": \"Vancouver\", \"Billing Province\": \"British Columbia\", \"Billing Province Code\": \"BC\", \"Billing Zip\": \"V5L 1J3\", \"Billing Country\": \"Canada\", \"Billing Country Code\": \"CA\", \"Taxes Included\": \"FALSE\", \"Mage Customer Id\": \"262518\"}, \"items\": [{\"Name\": \"1101284398\", \"Lineitem name\": \"Leather Round Buckle Belt in Black\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"44.5000\", \"Lineitem variant title\": \"2930005-003-M\", \"Lineitem compare at price\": \"49.5000\", \"Lineitem sku\": \"2930005-003-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"2.225\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"3.115\", \"Tax 2 Rate\": \"0.07\"}, {\"Name\": \"1101284398\", \"Lineitem name\": \"Long Sleeved Modal-Blend  Ribbed Tee in Black\", \"Lineitem quantity\": \"1.0000\", \"Lineitem price\": \"37.5000\", \"Lineitem variant title\": \"2120138-003-M\", \"Lineitem compare at price\": \"44.5000\", \"Lineitem sku\": \"2120138-003-M\", \"Lineitem requires shipping\": \"TRUE\", \"Lineitem taxable\": \"TRUE\", \"Lineitem fulfillment status\": \"fulfilled\", \"Tax 1 Title\": \"CAN - BC (GST)\", \"Tax 1 Price\": \"1.875\", \"Tax 1 Rate\": \"0.05\", \"Tax 2 Title\": \"CAN - BC (PST)\", \"Tax 2 Price\": \"2.625\", \"Tax 2 Rate\": \"0.07\"}], \"shipping\": {\"Name\": \"1101284398\", \"Shipping Line Code\": \"DOM.EP\", \"Shipping Line Price\": \"0.0000\", \"Shipping Line Source\": \"warehouse\", \"Shipping Line Title\": \"Frank + Oak - Standard Shipping\", \"Shipping Line Carrier Identifier\": \"canadapost\", \"Shipping Tax 1 Title\": \"shipping_tax\", \"Shipping Tax 1 Rate\": \"0.12\", \"Shipping Tax 1 Price\": \"0.0000\"}, \"payment\": {\"Name\": \"1101284398\", \"Transaction Amount\": \"91.8400\", \"Transaction Kind\": \"capture\", \"Transaction Status\": \"success\", \"Transaction Processed At\": \"2019-10-05T01:12:46+00:00\", \"Transaction Gateway\": \"paysafe\", \"Transaction Source Name\": \"Mozilla/5.0 (iPhone; CPU iPhone OS 12_4 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) CriOS/77.0.3865.69 Mobile/15E148 Safari/605.1\"}}",
  "status": "new"
}
